GO 
USE Fitness;

INSERT INTO exercises
VALUES
('Кошнички', 'Кошнички е упражнение за задните мускули на бедрата, което включва лежане на корема и изваждане на краката нагоре, като се стремят към докосване на тавана с пръстите на краката. Те се фокусират върху глутеуса и бедрените мускули и могат да подобрят силата и издръжливостта на задната част на бедрата.'),
('Преси', 'Пресите са упражнение за гърдите, което включва поддържане на тежести над главата, след което ги издигане и изправяне на ръцете. Те подобряват силата и формата на гърдите, раменете и трисепсите и могат да бъдат изпълнявани с различни вариации, включително с барбели, дъмбели или машина за преси.'),
('Лицеви упори', 'Лицеви упори са основно упражнение, което включва спускане и повдигане на тялото с помощта на ръцете. Те насочват се към гърдите, раменете и трисепсите, и могат да бъдат модифицирани за различни нива на трудност.'),
('Клекове', 'Клековете са основно упражнение за долната част на тялото, което включва извиване на коленете и спускане на хълбоците, като се запазва права гръбнака. Те насочват се към квадрицепсите, бедрените мускули и глутеуса и могат да бъдат изпълнени с или без тежести.'),
('Планк', 'Планкът е изометрично упражнение, което включва поддържане на права линия от главата до петите, като се подкрепя тялото на лактите и пръстите на краката. Той засилва мускулите в центъра на тялото, включително коремните, страничните и долната част на гръбнака.'),
('Страничен планк', 'Страничният планк е упражнение за коремните мускули, което включва сядане на пода с изправени колене и издигане на краката, като се въртят корема от страна на страна, докато се държи тежест или медицинска топка. Те насочват се към страничните коремни мускули и подобряват ротационната сила.'),
('Набирания', 'Набиранията са предизвикателно упражнение за горната част на тялото, което включва издърпване на тялото към лост, като се използват ръцете. Те основно насочват се към мускулите на гърба, включително широката област, както и към бицепсите и предмишниците.'),
('Приклякане', 'Приклякането е упражнение за долната част на тялото, което включва стъпване напред или назад с един крак и спускане на хълбоците, докато и двете колена са извити под ъгъл от 90 градуса. Те насочват се към квадрицепсите, бедрените мускули и глутеуса и подобряват баланса и координацията.'),
('Мъртва тяга', 'Мъртвата тяга е комплексно упражнение, което включва издигане на тежест от земята до изправено положение. Тя насочва се към мускулите на задната част на тялото, включително долната част на гръбнака, глутеуса и бедрените мускули, както и ангажира и коремните мускули и силата на захвата.'),
('Руско усукване ', 'Руско усукване са упражнение за коремните мускули, което включва сядане на пода с изправени колене и издигане на краката, като се въртят корема от страна на страна, докато се държи тежест или медицинска топка. Те насочват се към страничните коремни мускули и подобряват ротационната сила.');

