GO 
USE Fitness;

INSERT INTO exercises
VALUES
	('Кошнички', 'Кошнички е упражнение за задните мускули на бедрата, което включва лежане на корема и изваждане на краката нагоре, като се стремят към докосване на тавана с пръстите на краката. Те се фокусират върху глутеуса и бедрените мускули и могат да подобрят силата и издръжливостта на задната част на бедрата.'),
	('Преси', 'Пресите са упражнение за гърдите, което включва поддържане на тежести над главата, след което ги издигане и изправяне на ръцете. Те подобряват силата и формата на гърдите, раменете и трисепсите и могат да бъдат изпълнявани с различни вариации, включително с барбели, дъмбели или машина за преси.'),
	('Лицеви упори', 'Лицеви упори са основно упражнение, което включва спускане и повдигане на тялото с помощта на ръцете. Те насочват се към гърдите, раменете и трисепсите, и могат да бъдат модифицирани за различни нива на трудност.'),
	('Клекове', 'Клековете са основно упражнение за долната част на тялото, което включва извиване на коленете и спускане на хълбоците, като се запазва права гръбнака. Те насочват се към квадрицепсите, бедрените мускули и глутеуса и могат да бъдат изпълнени с или без тежести.'),
	('Планк', 'Планкът е изометрично упражнение, което включва поддържане на права линия от главата до петите, като се подкрепя тялото на лактите и пръстите на краката. Той засилва мускулите в центъра на тялото, включително коремните, страничните и долната част на гръбнака.'),
	('Страничен планк', 'Страничният планк е упражнение за коремните мускули, което включва сядане на пода с изправени колене и издигане на краката, като се въртят корема от страна на страна, докато се държи тежест или медицинска топка. Те насочват се към страничните коремни мускули и подобряват ротационната сила.'),
	('Набирания', 'Набиранията са предизвикателно упражнение за горната част на тялото, което включва издърпване на тялото към лост, като се използват ръцете. Те основно насочват се към мускулите на гърба, включително широката област, както и към бицепсите и предмишниците.'),
	('Приклякане', 'Приклякането е упражнение за долната част на тялото, което включва стъпване напред или назад с един крак и спускане на хълбоците, докато и двете колена са извити под ъгъл от 90 градуса. Те насочват се към квадрицепсите, бедрените мускули и глутеуса и подобряват баланса и координацията.'),
	('Мъртва тяга', 'Мъртвата тяга е комплексно упражнение, което включва издигане на тежест от земята до изправено положение. Тя насочва се към мускулите на задната част на тялото, включително долната част на гръбнака, глутеуса и бедрените мускули, както и ангажира и коремните мускули и силата на захвата.'),
	('Руско усукване ', 'Руско усукване са упражнение за коремните мускули, което включва сядане на пода с изправени колене и издигане на краката, като се въртят корема от страна на страна, докато се държи тежест или медицинска топка. Те насочват се към страничните коремни мускули и подобряват ротационната сила.');


INSERT INTO workouts (title, leading_muscle_group, price)
VALUES
	('Тренировка 1', 'корем', 20.00),
	('Тренировка 2', 'крака', 25.00),
	('Тренировка 3', 'ръце', 15.00),
	('Тренировка 4', 'гръб', 30.00),
	('Тренировка 5', 'горна част', 20.00),
	('Тренировка 6', 'глутеус', 25.00),
	('Тренировка 7', 'корем', 22.50),
	('Тренировка 8', 'крака', 27.50),
	('Тренировка 9', 'ръце', 18.00),
	('Тренировка 10', 'горна част', 22.00);

INSERT INTO trainers (first_name, last_name)
VALUES
	('Иван', 'Иванов'),
	('Петър', 'Петров'),
	('Мария', 'Иванова'),
	('Георги', 'Георгиев'),
	('Елена', 'Петрова'),
	('Николай', 'Николов'),
	('Светлана', 'Георгиева'),
	('Станимир', 'Иванов'),
	('Анна', 'Николова'),
	('Владимир', 'Станчев');
	
INSERT INTO clients (first_name, last_name)
VALUES
	('Андрей', 'Иванов'),
	('Светла', 'Петрова'),
	('Павел', 'Георгиев'),
	('Анна', 'Николова'),
	('Илия', 'Станчев'),
	('Елена', 'Иванова'),
	('Петя', 'Петкова'),
	('Мария', 'Георгиева'),
	('Николай', 'Николов'),
	('Георги', 'Петров');
	
INSERT INTO workouts_exercises
VALUES
	('2000','1001'),
	('2000','1000'),
	('2000','1007'),
	--
	('2001','1000'),
	('2001','1005'),
	('2001','1003'),
	('2001','1006'),
	--
	('2002','1005'),
	('2002','1006'),
	('2002','1009'),
	('2002','1003'),
	--
	('2003','1003'),
	('2003','1007'),
	('2003','1002'),
	('2003','1000'),
	('2003','1001'),
	('2003','1008'),
	--
	('2004','1005'),
	('2004','1009'),
	('2004','1000'),
	('2004','1007'),
	--
	('2005','1008'),
	('2005','1005'),
	('2005','1004'),
	('2005','1009'),
	('2005','1007'),
	--
	('2006','1009'),
	('2006','1007'),
	('2006','1004'),
	('2006','1002'),
	--
	('2007','1002'),
	('2007','1006'),
	('2007','1004'),
	--
	('2008','1004'),
	('2008','1000'),
	('2008','1003'),
	('2008','1009'),
	('2008','1002'),
	--
	('2009','1002'),
	('2009','1008'),
	('2009','1006'),
	('2009','1003');
	
INSERT INTO trainers_workouts
VALUES
	('2000','3005'),
	('2000','3000'),
	('2000','3008'),
	('2000','3006'),
	--
	('2001','3002'),
	('2001','3000'),
	--
	('2002','3003'),
	('2002','3004'),
	--
	('2003','3003'),
	('2003','3005'),
	('2003','3007'),
	--
	('2004','3007'),
	('2004','3005'),
	('2004','3000'),
	--
	('2005','3007'),
	('2005','3006'),
	('2005','3002'),
	--
	('2006','3008'),
	('2006','3007'),
	('2006','3001'),
	--
	('2007','3003'),
	('2007','3006'),
	('2007','3005'),
	('2007','3004'),
	--
	('2008','3005'),
	('2008','3000'),
	('2008','3001'),
	('2008','3002'),
	--
	('2009','3001'),
	('2009','3002'),
	('2009','3005');
	
SELECT * FROM trainers_workouts;

INSERT INTO appointments (workout_id, client_id, trainer_id, appointent_time, isValidAppointment)
VALUES
	(2001, 4001, 3001, '2024-02-22 09:00:00', NULL),
	(2002, 4002, 3002, '2024-03-23 10:30:00', 1),
	(2003, 4003, 3003, '2024-02-24 14:00:00', 0),
	(2004, 4004, 3004, '2024-03-25 15:30:00', 1),
	(2005, 4005, 3005, '2024-03-26 11:00:00', 1),
	(2006, 4006, 3006, '2024-02-27 16:00:00', NULL),
	(2007, 4007, 3007, '2024-03-28 13:00:00', 0),
	(2008, 4008, 3008, '2024-03-29 08:30:00', 0),
	(2009, 4009, 3009, '2024-01-30 17:00:00', NULL),
	(2000, 4000, 3000, '2024-03-31 12:00:00', 1);

SELECT * FROM appointments;